{
    "metadata": {
        "request-pipeline": [
            "libcloudcore.serializers.xml:XmlSerializer"
        ]
    },
    "endpoints": [
        {
            "when": [
                [
                    "region",
                    "starts-with",
                    "cn-"
                ]
            ],
            "http": {
                "host": "{service}.{region}.amazonaws.com.cn"
            }
        },
        {
            "when": [
                [
                    "region",
                    "not-equals",
                    null
                ]
            ],
            "http": {
                "host": "{service}.{region}.amazonaws.com"
            }
        }
    ],
    "operations": {
        "CreateFileSystem": {
            "documentation": "Creates a new, empty file system. The operation requires a creation token in the request that Amazon EFS uses to ensure idempotent creation (calling the operation with same creation token has no effect). If a file system does not currently exist that is owned by the caller's AWS account with the specified creation token, this operation does the following: \n\n \n\n  * Creates a new, empty file system. The file system will have an Amazon EFS assigned ID, and an initial lifecycle state \"creating\". \n  *  Returns with the description of the created file system. \n \n Otherwise, this operation returns a ``FileSystemAlreadyExists`` error with the ID of the existing file system.\n\n For basic use cases, you can use a randomly generated UUID for the creation token.  The idempotent operation allows you to retry a ``CreateFileSystem`` call without risk of creating an extra file system. This can happen when an initial call fails in a way that leaves it uncertain whether or not a file system was actually created. An example might be that a transport level timeout occurred or your connection was reset. As long as you use the same creation token, if the initial call had succeeded in creating a file system, the client can learn of its existence from the ``FileSystemAlreadyExists`` error. \n\n The ``CreateFileSystem`` call returns while the file system's lifecycle state is still \"creating\". You can check the file system creation status by calling the DescribeFileSystems API, which among other things returns the file system state.  After the file system is fully created, Amazon EFS sets its lifecycle state to \"available\", at which point you can create one or more mount targets for the file system (CreateMountTarget) in your VPC. You mount your Amazon EFS file system on an EC2 instances in your VPC via the mount target. For more information, see `Amazon EFS: How it Works <http://docs.aws.amazon.com/efs/latest/ug/how-it-works.html>`_ \n\n  This operation requires permission for the ``elasticfilesystem:CreateFileSystem`` action.",
            "input": {
                "shape": "CreateFileSystemRequest"
            },
            "output": {
                "shape": "FileSystemDescription"
            }
        },
        "CreateMountTarget": {
            "documentation": "Creates a mount target for a file system. You can then mount the file system on EC2 instances via the mount target. \n\n You can create one mount target in each Availability Zone in your VPC. All EC2 instances in a VPC within a given Availability Zone share a single mount target for a given file system. If you have multiple subnets in an Availability Zone, you create a mount target in one of the subnets. EC2 instances do not need to be in the same subnet as the mount target in order to access their file system. For more information, see `Amazon EFS: How it Works <http://docs.aws.amazon.com/efs/latest/ug/how-it-works.html>`_. \n\n In the request, you also specify a file system ID for which you are creating the mount target and the file system's lifecycle state must be \"available\" (see DescribeFileSystems).\n\n  In the request, you also provide a subnet ID, which serves several purposes:\n\n \n\n  * It determines the VPC in which Amazon EFS creates the mount target.\n  * It determines the Availability Zone in which Amazon EFS creates the mount target. \n  * It determines the IP address range from which Amazon EFS selects the IP address of the mount target if you don't specify an IP address in the request. \n \n After creating the mount target, Amazon EFS returns a response that includes, a ``MountTargetId`` and an ``IpAddress``. You use this IP address when mounting the file system in an EC2 instance. You can also use the mount target's DNS name when mounting the file system. The EC2 instance on which you mount the file system via the mount target can resolve the mount target's DNS name to its IP address. For more information, see `How it Works: Implementation Overview <http://docs.aws.amazon.com/efs/latest/ug/how-it-works.html#how-it-works-implementation>`_ \n\n  Note that you can create mount targets for a file system in only one VPC, and there can be only one mount target per Availability Zone. That is, if the file system already has one or more mount targets created for it, the request to add another mount target must meet the following requirements: \n\n \n\n  *  The subnet specified in the request must belong to the same VPC as the subnets of the existing mount targets.\n\n \n  * The subnet specified in the request must not be in the same Availability Zone as any of the subnets of the existing mount targets.\n \n If the request satisfies the requirements, Amazon EFS does the following:\n\n \n\n  * Creates a new mount target in the specified subnet. \n  * Also creates a new network interface in the subnet as follows: \n\n  * If the request provides an ``IpAddress``, Amazon EFS assigns that IP address to the network interface. Otherwise, Amazon EFS assigns a free address in the subnet (in the same way that the Amazon EC2 ``CreateNetworkInterface`` call does when a request does not specify a primary private IP address).\n  * If the request provides ``SecurityGroups``, this network interface is associated with those security groups. Otherwise, it belongs to the default security group for the subnet's VPC.\n  * Assigns the description ``\"Mount target *fsmt-id* for file system *fs-id*\"`` where ``*fsmt-id*`` is the mount target ID, and ``*fs-id*`` is the ``FileSystemId``.\n  * Sets the ``requesterManaged`` property of the network interface to \"true\", and the ``requesterId`` value to \"EFS\".\n \n Each Amazon EFS mount target has one corresponding requestor-managed EC2 network interface. After the network interface is created, Amazon EFS sets the ``NetworkInterfaceId`` field in the mount target's description to the network interface ID, and the ``IpAddress`` field to its address. If network interface creation fails, the entire ``CreateMountTarget`` operation fails.\n\n \n \n The ``CreateMountTarget`` call returns only after creating the network interface, but while the mount target state is still \"creating\". You can check the mount target creation status by calling the DescribeFileSystems API, which among other things returns the mount target state. We recommend you create a mount target in each of the Availability Zones. There are cost considerations for using a file system in an Availability Zone through a mount target created in another Availability Zone. For more information, go to `Amazon EFS <http://aws.amazon.com/efs/>`_ product detail page. In addition, by always using a mount target local to the instance's Availability Zone, you eliminate a partial failure scenario; if the Availablity Zone in which your mount target is created goes down, then you won't be able to access your file system through that mount target. \n\n This operation requires permission for the following action on the file system:\n\n \n\n  * ``elasticfilesystem:CreateMountTarget``\n \n This operation also requires permission for the following Amazon EC2 actions:\n\n \n\n  * ``ec2:DescribeSubnets``\n  * ``ec2:DescribeNetworkInterfaces``\n  * ``ec2:CreateNetworkInterface``",
            "input": {
                "shape": "CreateMountTargetRequest"
            },
            "output": {
                "shape": "MountTargetDescription"
            }
        },
        "CreateTags": {
            "documentation": "Creates or overwrites tags associated with a file system. Each tag is a key-value pair. If a tag key specified in the request already exists on the file system, this operation overwrites its value with the value provided in the request. If you add the \"Name\" tag to your file system, Amazon EFS returns it in the response to the DescribeFileSystems API. \n\n This operation requires permission for the ``elasticfilesystem:CreateTags`` action.",
            "input": {
                "shape": "CreateTagsRequest"
            }
        },
        "DeleteFileSystem": {
            "documentation": "Deletes a file system, permanently severing access to its contents. Upon return, the file system no longer exists and you will not be able to access any contents of the deleted file system. \n\n  You cannot delete a file system that is in use. That is, if the file system has any mount targets, you must first delete them. For more information, see DescribeMountTargets and DeleteMountTarget. \n\n The ``DeleteFileSystem`` call returns while the file system state is still \"deleting\". You can check the file system deletion status by calling the DescribeFileSystems API, which returns a list of file systems in your account. If you pass file system ID or creation token for the deleted file system, the DescribeFileSystems will return a 404 \"FileSystemNotFound\" error. This operation requires permission for the ``elasticfilesystem:DeleteFileSystem`` action.",
            "input": {
                "shape": "DeleteFileSystemRequest"
            }
        },
        "DeleteMountTarget": {
            "documentation": "Deletes the specified mount target. \n\n  This operation forcibly breaks any mounts of the file system via the mount target being deleted, which might disrupt instances or applications using those mounts. To avoid applications getting cut off abruptly, you might consider unmounting any mounts of the mount target, if feasible. The operation also deletes the associated network interface. Uncommitted writes may be lost, but breaking a mount target using this operation does not corrupt the file system itself. The file system you created remains. You can mount an EC2 instance in your VPC using another mount target. \n\n  This operation requires permission for the following action on the file system: \n\n \n\n  * ``elasticfilesystem:DeleteMountTarget``\n \n The ``DeleteMountTarget`` call returns while the mount target state is still \"deleting\". You can check the mount target deletion by calling the DescribeMountTargets API, which returns a list of mount target descriptions for the given file system.  The operation also requires permission for the following Amazon EC2 action on the mount target's network interface:\n\n \n\n  * ``ec2:DeleteNetworkInterface``",
            "input": {
                "shape": "DeleteMountTargetRequest"
            }
        },
        "DeleteTags": {
            "documentation": "Deletes the specified tags from a file system. If the ``DeleteTags`` request includes a tag key that does not exist, Amazon EFS ignores it; it is not an error. For more information about tags and related restrictions, go to `Tag Restrictions <http://docs.aws.amazon.com/awsaccountbilling/latest/aboutv2/cost-alloc-tags.html>`_ in the *AWS Billing and Cost Management User Guide*.\n\n This operation requires permission for the ``elasticfilesystem:DeleteTags`` action.",
            "input": {
                "shape": "DeleteTagsRequest"
            }
        },
        "DescribeFileSystems": {
            "documentation": "Returns the description of a specific Amazon EFS file system if either the file system ``CreationToken`` or the ``FileSystemId`` is provided; otherwise, returns descriptions of all file systems owned by the caller's AWS account in the AWS region of the endpoint that you're calling.\n\n  When retrieving all file system descriptions, you can optionally specify the ``MaxItems`` parameter to limit the number of descriptions in a response. If more file system descriptions remain, Amazon EFS returns a ``NextMarker``, an opaque token, in the response. In this case, you should send a subsequent request with the ``Marker`` request parameter set to the value of ``NextMarker``. \n\n  So to retrieve a list of your file system descriptions, the expected usage of this API is an iterative process of first calling ``DescribeFileSystems`` without the ``Marker`` and then continuing to call it with the ``Marker`` parameter set to the value of the ``NextMarker`` from the previous response until the response has no ``NextMarker``. \n\n  Note that the implementation may return fewer than ``MaxItems`` file system descriptions while still including a ``NextMarker`` value. \n\n  The order of file systems returned in the response of one ``DescribeFileSystems`` call, and the order of file systems returned across the responses of a multi-call iteration, is unspecified. \n\n  This operation requires permission for the ``elasticfilesystem:DescribeFileSystems`` action.",
            "input": {
                "shape": "DescribeFileSystemsRequest"
            },
            "output": {
                "shape": "DescribeFileSystemsResponse"
            }
        },
        "DescribeMountTargetSecurityGroups": {
            "documentation": "Returns the security groups currently in effect for a mount target. This operation requires that the network interface of the mount target has been created and the life cycle state of the mount target is not \"deleted\".\n\n This operation requires permissions for the following actions:\n\n \n\n  *  ``elasticfilesystem:DescribeMountTargetSecurityGroups`` action on the mount target's file system. \n  *  ``ec2:DescribeNetworkInterfaceAttribute`` action on the mount target's network interface.",
            "input": {
                "shape": "DescribeMountTargetSecurityGroupsRequest"
            },
            "output": {
                "shape": "DescribeMountTargetSecurityGroupsResponse"
            }
        },
        "DescribeMountTargets": {
            "documentation": "Returns the descriptions of the current mount targets for a file system. The order of mount targets returned in the response is unspecified.\n\n  This operation requires permission for the ``elasticfilesystem:DescribeMountTargets`` action on the file system ``FileSystemId``.",
            "input": {
                "shape": "DescribeMountTargetsRequest"
            },
            "output": {
                "shape": "DescribeMountTargetsResponse"
            }
        },
        "DescribeTags": {
            "documentation": "Returns the tags associated with a file system. The order of tags returned in the response of one ``DescribeTags`` call, and the order of tags returned across the responses of a multi-call iteration (when using pagination), is unspecified. \n\n  This operation requires permission for the ``elasticfilesystem:DescribeTags`` action.",
            "input": {
                "shape": "DescribeTagsRequest"
            },
            "output": {
                "shape": "DescribeTagsResponse"
            }
        },
        "ModifyMountTargetSecurityGroups": {
            "documentation": "Modifies the set of security groups in effect for a mount target.\n\n When you create a mount target, Amazon EFS also creates a new network interface (see CreateMountTarget). This operation replaces the security groups in effect for the network interface associated with a mount target, with the ``SecurityGroups`` provided in the request. This operation requires that the network interface of the mount target has been created and the life cycle state of the mount target is not \"deleted\". \n\n The operation requires permissions for the following actions:\n\n \n\n  *  ``elasticfilesystem:ModifyMountTargetSecurityGroups`` action on the mount target's file system. \n  *  ``ec2:ModifyNetworkInterfaceAttribute`` action on the mount target's network interface.",
            "input": {
                "shape": "ModifyMountTargetSecurityGroupsRequest"
            }
        }
    },
    "shapes": {
        "AwsAccountId": {
            "type": "string"
        },
        "BadRequest": {
            "type": "structure",
            "documentation": "Returned if the request is malformed or contains an error such as an invalid parameter value or a missing required parameter.",
            "members": [
                {
                    "name": "ErrorCode",
                    "shape": "ErrorCode"
                },
                {
                    "name": "Message",
                    "shape": "ErrorMessage"
                }
            ]
        },
        "CreateFileSystemRequest": {
            "type": "structure",
            "members": [
                {
                    "name": "CreationToken",
                    "shape": "CreationToken",
                    "documentation": "<p>String of up to 64 ASCII characters. Amazon EFS uses this to ensure idempotent creation.</p>"
                }
            ]
        },
        "CreateMountTargetRequest": {
            "type": "structure",
            "members": [
                {
                    "name": "FileSystemId",
                    "shape": "FileSystemId",
                    "documentation": "<p>The ID of the file system for which to create the mount target.</p>"
                },
                {
                    "name": "SubnetId",
                    "shape": "SubnetId",
                    "documentation": "<p>The ID of the subnet to add the mount target in.</p>"
                },
                {
                    "name": "IpAddress",
                    "shape": "IpAddress",
                    "documentation": "<p>A valid IPv4 address within the address range of the specified subnet.</p>"
                },
                {
                    "name": "SecurityGroups",
                    "shape": "SecurityGroups",
                    "documentation": "<p> Up to 5 VPC security group IDs, of the form \"sg-xxxxxxxx\". These must be for the same VPC as subnet specified. </p>"
                }
            ]
        },
        "CreateTagsRequest": {
            "type": "structure",
            "members": [
                {
                    "name": "FileSystemId",
                    "shape": "FileSystemId",
                    "location": "uri",
                    "locationName": "FileSystemId",
                    "documentation": "<p>String. The ID of the file system whose tags you want to modify. This operation modifies only the tags and not the file system.</p>"
                },
                {
                    "name": "Tags",
                    "shape": "Tags",
                    "documentation": "<p> An array of <code>Tag</code> objects to add. Each <code>Tag</code> object is a key-value pair. </p>"
                }
            ]
        },
        "CreationToken": {
            "type": "string"
        },
        "DeleteFileSystemRequest": {
            "type": "structure",
            "members": [
                {
                    "name": "FileSystemId",
                    "shape": "FileSystemId",
                    "location": "uri",
                    "locationName": "FileSystemId",
                    "documentation": "<p>The ID of the file system you want to delete.</p>"
                }
            ]
        },
        "DeleteMountTargetRequest": {
            "type": "structure",
            "members": [
                {
                    "name": "MountTargetId",
                    "shape": "MountTargetId",
                    "location": "uri",
                    "locationName": "MountTargetId",
                    "documentation": "<p>String. The ID of the mount target to delete.</p>"
                }
            ]
        },
        "DeleteTagsRequest": {
            "type": "structure",
            "members": [
                {
                    "name": "FileSystemId",
                    "shape": "FileSystemId",
                    "location": "uri",
                    "locationName": "FileSystemId",
                    "documentation": "<p>String. The ID of the file system whose tags you want to delete.</p>"
                },
                {
                    "name": "TagKeys",
                    "shape": "TagKeys",
                    "documentation": "<p>A list of tag keys to delete.</p>"
                }
            ]
        },
        "DependencyTimeout": {
            "type": "structure",
            "documentation": "The service timed out trying to fulfill the request, and the client should try the call again.",
            "members": [
                {
                    "name": "ErrorCode",
                    "shape": "ErrorCode"
                },
                {
                    "name": "Message",
                    "shape": "ErrorMessage"
                }
            ]
        },
        "DescribeFileSystemsRequest": {
            "type": "structure",
            "members": [
                {
                    "name": "MaxItems",
                    "shape": "MaxItems",
                    "location": "querystring",
                    "locationName": "MaxItems",
                    "documentation": "<p>Optional integer. Specifies the maximum number of file systems to return in the response. This parameter value must be greater than 0. The number of items Amazon EFS returns will be the minimum of the <code>MaxItems</code> parameter specified in the request and the service's internal maximum number of items per page. </p>"
                },
                {
                    "name": "Marker",
                    "shape": "Marker",
                    "location": "querystring",
                    "locationName": "Marker",
                    "documentation": "<p> Optional string. Opaque pagination token returned from a previous <code>DescribeFileSystems</code> operation. If present, specifies to continue the list from where the returning call had left off. </p>"
                },
                {
                    "name": "CreationToken",
                    "shape": "CreationToken",
                    "location": "querystring",
                    "locationName": "CreationToken",
                    "documentation": "<p> Optional string. Restricts the list to the file system with this creation token (you specify a creation token at the time of creating an Amazon EFS file system). </p>"
                },
                {
                    "name": "FileSystemId",
                    "shape": "FileSystemId",
                    "location": "querystring",
                    "locationName": "FileSystemId",
                    "documentation": "<p>Optional string. File system ID whose description you want to retrieve. </p>"
                }
            ]
        },
        "DescribeFileSystemsResponse": {
            "type": "structure",
            "members": [
                {
                    "name": "Marker",
                    "shape": "Marker",
                    "documentation": "<p>A string, present if provided by caller in the request.</p>"
                },
                {
                    "name": "FileSystems",
                    "shape": "FileSystemDescriptions",
                    "documentation": "<p>An array of file system descriptions.</p>"
                },
                {
                    "name": "NextMarker",
                    "shape": "Marker",
                    "documentation": "<p>A string, present if there are more file systems than returned in the response. You can use the <code>NextMarker</code> in the subsequent request to fetch the descriptions.</p>"
                }
            ]
        },
        "DescribeMountTargetSecurityGroupsRequest": {
            "type": "structure",
            "members": [
                {
                    "name": "MountTargetId",
                    "shape": "MountTargetId",
                    "location": "uri",
                    "locationName": "MountTargetId",
                    "documentation": "<p>The ID of the mount target whose security groups you want to retrieve.</p>"
                }
            ]
        },
        "DescribeMountTargetSecurityGroupsResponse": {
            "type": "structure",
            "members": [
                {
                    "name": "SecurityGroups",
                    "shape": "SecurityGroups",
                    "documentation": "<p>An array of security groups.</p>"
                }
            ]
        },
        "DescribeMountTargetsRequest": {
            "type": "structure",
            "members": [
                {
                    "name": "MaxItems",
                    "shape": "MaxItems",
                    "location": "querystring",
                    "locationName": "MaxItems",
                    "documentation": "<p>Optional. Maximum number of mount targets to return in the response. It must be an integer with a value greater than zero.</p>"
                },
                {
                    "name": "Marker",
                    "shape": "Marker",
                    "location": "querystring",
                    "locationName": "Marker",
                    "documentation": "<p>Optional. String. Opaque pagination token returned from a previous <code>DescribeMountTargets</code> operation. If present, it specifies to continue the list from where the previous returning call left off.</p>"
                },
                {
                    "name": "FileSystemId",
                    "shape": "FileSystemId",
                    "location": "querystring",
                    "locationName": "FileSystemId",
                    "documentation": "<p>String. The ID of the file system whose mount targets you want to list.</p>"
                }
            ]
        },
        "DescribeMountTargetsResponse": {
            "type": "structure",
            "members": [
                {
                    "name": "Marker",
                    "shape": "Marker",
                    "documentation": "<p>If the request included the <code>Marker</code>, the response returns that value in this field.</p>"
                },
                {
                    "name": "MountTargets",
                    "shape": "MountTargetDescriptions",
                    "documentation": "<p>Returns the file system's mount targets as an array of <code>MountTargetDescription</code> objects.</p>"
                },
                {
                    "name": "NextMarker",
                    "shape": "Marker",
                    "documentation": "<p>If a value is present, there are more mount targets to return. In a subsequent request, you can provide <code>Marker</code> in your request with this value to retrieve the next set of mount targets.</p>"
                }
            ]
        },
        "DescribeTagsRequest": {
            "type": "structure",
            "members": [
                {
                    "name": "MaxItems",
                    "shape": "MaxItems",
                    "location": "querystring",
                    "locationName": "MaxItems",
                    "documentation": "<p>Optional. Maximum number of file system tags to return in the response. It must be an integer with a value greater than zero.</p>"
                },
                {
                    "name": "Marker",
                    "shape": "Marker",
                    "location": "querystring",
                    "locationName": "Marker",
                    "documentation": "<p>Optional. String. Opaque pagination token returned from a previous <code>DescribeTags</code> operation. If present, it specifies to continue the list from where the previous call left off.</p>"
                },
                {
                    "name": "FileSystemId",
                    "shape": "FileSystemId",
                    "location": "uri",
                    "locationName": "FileSystemId",
                    "documentation": "<p>The ID of the file system whose tag set you want to retrieve.</p>"
                }
            ]
        },
        "DescribeTagsResponse": {
            "type": "structure",
            "members": [
                {
                    "name": "Marker",
                    "shape": "Marker",
                    "documentation": "<p>If the request included a <code>Marker</code>, the response returns that value in this field.</p>"
                },
                {
                    "name": "Tags",
                    "shape": "Tags",
                    "documentation": "<p>Returns tags associated with the file system as an array of <code>Tag</code> objects. </p>"
                },
                {
                    "name": "NextMarker",
                    "shape": "Marker",
                    "documentation": "<p>If a value is present, there are more tags to return. In a subsequent request, you can provide the value of <code>NextMarker</code> as the value of the <code>Marker</code> parameter in your next request to retrieve the next set of tags.</p>"
                }
            ]
        },
        "ErrorCode": {
            "type": "string"
        },
        "ErrorMessage": {
            "type": "string"
        },
        "FileSystemAlreadyExists": {
            "type": "structure",
            "documentation": "Returned if the file system you are trying to create already exists, with the creation token you provided.",
            "members": [
                {
                    "name": "ErrorCode",
                    "shape": "ErrorCode"
                },
                {
                    "name": "Message",
                    "shape": "ErrorMessage"
                },
                {
                    "name": "FileSystemId",
                    "shape": "FileSystemId"
                }
            ]
        },
        "FileSystemDescription": {
            "type": "structure",
            "documentation": "This object provides description of a file system.",
            "members": [
                {
                    "name": "OwnerId",
                    "shape": "AwsAccountId",
                    "documentation": "<p>The AWS account that created the file system. If the file system was created by an IAM user, the parent account to which the user belongs is the owner.</p>"
                },
                {
                    "name": "CreationToken",
                    "shape": "CreationToken",
                    "documentation": "<p>Opaque string specified in the request. </p>"
                },
                {
                    "name": "FileSystemId",
                    "shape": "FileSystemId",
                    "documentation": "<p>The file system ID assigned by Amazon EFS.</p>"
                },
                {
                    "name": "CreationTime",
                    "shape": "Timestamp",
                    "documentation": "<p>The time at which the file system was created, in seconds, since 1970-01-01T00:00:00Z.</p>"
                },
                {
                    "name": "LifeCycleState",
                    "shape": "LifeCycleState",
                    "documentation": "<p>A predefined string value that indicates the lifecycle phase of the file system. </p>"
                },
                {
                    "name": "Name",
                    "shape": "TagValue",
                    "documentation": "<p>You can add tags to a file system (see <a>CreateTags</a>) including a \"Name\" tag. If the file system has a \"Name\" tag, Amazon EFS returns the value in this field. </p>"
                },
                {
                    "name": "NumberOfMountTargets",
                    "shape": "MountTargetCount",
                    "documentation": "<p>The current number of mount targets (see <a>CreateMountTarget</a>) the file system has.</p>"
                },
                {
                    "name": "SizeInBytes",
                    "shape": "FileSystemSize",
                    "documentation": "<p> This object provides the latest known metered size of data stored in the file system, in bytes, in its <code>Value</code> field, and the time at which that size was determined in its <code>Timestamp</code> field. The <code>Timestamp</code> value is the integer number of seconds since 1970-01-01T00:00:00Z. Note that the value does not represent the size of a consistent snapshot of the file system, but it is eventually consistent when there are no writes to the file system. That is, the value will represent actual size only if the file system is not modified for a period longer than a couple of hours. Otherwise, the value is not the exact size the file system was at any instant in time. </p>"
                }
            ]
        },
        "FileSystemDescriptions": {
            "type": "list",
            "of": "FileSystemDescription"
        },
        "FileSystemId": {
            "type": "string"
        },
        "FileSystemInUse": {
            "type": "structure",
            "documentation": "Returned if a file system has mount targets.",
            "members": [
                {
                    "name": "ErrorCode",
                    "shape": "ErrorCode"
                },
                {
                    "name": "Message",
                    "shape": "ErrorMessage"
                }
            ]
        },
        "FileSystemLimitExceeded": {
            "type": "structure",
            "documentation": "Returned if the AWS account has already created maximum number of file systems allowed per account.",
            "members": [
                {
                    "name": "ErrorCode",
                    "shape": "ErrorCode"
                },
                {
                    "name": "Message",
                    "shape": "ErrorMessage"
                }
            ]
        },
        "FileSystemNotFound": {
            "type": "structure",
            "documentation": "Returned if the specified ``FileSystemId`` does not exist in the requester's AWS account.",
            "members": [
                {
                    "name": "ErrorCode",
                    "shape": "ErrorCode"
                },
                {
                    "name": "Message",
                    "shape": "ErrorMessage"
                }
            ]
        },
        "FileSystemSize": {
            "type": "structure",
            "documentation": "This object provides the latest known metered size, in bytes, of data stored in the file system, in its ``Value`` field, and the time at which that size was determined in its ``Timestamp`` field. Note that the value does not represent the size of a consistent snapshot of the file system, but it is eventually consistent when there are no writes to the file system. That is, the value will represent the actual size only if the file system is not modified for a period longer than a couple of hours. Otherwise, the value is not necessarily the exact size the file system was at any instant in time.",
            "members": [
                {
                    "name": "Value",
                    "shape": "FileSystemSizeValue",
                    "documentation": "<p>The latest known metered size, in bytes, of data stored in the file system.</p>"
                },
                {
                    "name": "Timestamp",
                    "shape": "Timestamp",
                    "documentation": "<p>The time at which the size of data, returned in the <code>Value</code> field, was determined. The value is the integer number of seconds since 1970-01-01T00:00:00Z.</p>"
                }
            ]
        },
        "FileSystemSizeValue": {
            "type": "long"
        },
        "IncorrectFileSystemLifeCycleState": {
            "type": "structure",
            "documentation": "Returned if the file system's life cycle state is not \"created\".",
            "members": [
                {
                    "name": "ErrorCode",
                    "shape": "ErrorCode"
                },
                {
                    "name": "Message",
                    "shape": "ErrorMessage"
                }
            ]
        },
        "IncorrectMountTargetState": {
            "type": "structure",
            "documentation": "Returned if the mount target is not in the correct state for the operation.",
            "members": [
                {
                    "name": "ErrorCode",
                    "shape": "ErrorCode"
                },
                {
                    "name": "Message",
                    "shape": "ErrorMessage"
                }
            ]
        },
        "InternalServerError": {
            "type": "structure",
            "documentation": "Returned if an error occurred on the server side.",
            "members": [
                {
                    "name": "ErrorCode",
                    "shape": "ErrorCode"
                },
                {
                    "name": "Message",
                    "shape": "ErrorMessage"
                }
            ]
        },
        "IpAddress": {
            "type": "string"
        },
        "IpAddressInUse": {
            "type": "structure",
            "documentation": "Returned if the request specified an ``IpAddress`` that is already in use in the subnet.",
            "members": [
                {
                    "name": "ErrorCode",
                    "shape": "ErrorCode"
                },
                {
                    "name": "Message",
                    "shape": "ErrorMessage"
                }
            ]
        },
        "LifeCycleState": {
            "type": "string"
        },
        "Marker": {
            "type": "string"
        },
        "MaxItems": {
            "type": "integer"
        },
        "ModifyMountTargetSecurityGroupsRequest": {
            "type": "structure",
            "members": [
                {
                    "name": "MountTargetId",
                    "shape": "MountTargetId",
                    "location": "uri",
                    "locationName": "MountTargetId",
                    "documentation": "<p>The ID of the mount target whose security groups you want to modify.</p>"
                },
                {
                    "name": "SecurityGroups",
                    "shape": "SecurityGroups",
                    "documentation": "<p>An array of up to five VPC security group IDs.</p>"
                }
            ]
        },
        "MountTargetConflict": {
            "type": "structure",
            "documentation": "Returned if the mount target would violate one of the specified restrictions based on the file system's existing mount targets.",
            "members": [
                {
                    "name": "ErrorCode",
                    "shape": "ErrorCode"
                },
                {
                    "name": "Message",
                    "shape": "ErrorMessage"
                }
            ]
        },
        "MountTargetCount": {
            "type": "integer"
        },
        "MountTargetDescription": {
            "type": "structure",
            "documentation": "This object provides description of a mount target.",
            "members": [
                {
                    "name": "OwnerId",
                    "shape": "AwsAccountId",
                    "documentation": "<p>The AWS account ID that owns the resource.</p>"
                },
                {
                    "name": "MountTargetId",
                    "shape": "MountTargetId",
                    "documentation": "<p>The system-assigned mount target ID. </p>"
                },
                {
                    "name": "FileSystemId",
                    "shape": "FileSystemId",
                    "documentation": "<p>The ID of the file system for which the mount target is intended.</p>"
                },
                {
                    "name": "SubnetId",
                    "shape": "SubnetId",
                    "documentation": "<p>The ID of the subnet that the mount target is in.</p>"
                },
                {
                    "name": "LifeCycleState",
                    "shape": "LifeCycleState",
                    "documentation": "<p>The lifecycle state the mount target is in.</p>"
                },
                {
                    "name": "IpAddress",
                    "shape": "IpAddress",
                    "documentation": "<p>The address at which the file system may be mounted via the mount target.</p>"
                },
                {
                    "name": "NetworkInterfaceId",
                    "shape": "NetworkInterfaceId",
                    "documentation": "<p>The ID of the network interface that Amazon EFS created when it created the mount target.</p>"
                }
            ]
        },
        "MountTargetDescriptions": {
            "type": "list",
            "of": "MountTargetDescription"
        },
        "MountTargetId": {
            "type": "string"
        },
        "MountTargetNotFound": {
            "type": "structure",
            "documentation": "Returned if there is no mount target with the specified ID is found in the caller's account.",
            "members": [
                {
                    "name": "ErrorCode",
                    "shape": "ErrorCode"
                },
                {
                    "name": "Message",
                    "shape": "ErrorMessage"
                }
            ]
        },
        "NetworkInterfaceId": {
            "type": "string"
        },
        "NetworkInterfaceLimitExceeded": {
            "type": "structure",
            "documentation": "The calling account has reached the ENI limit for the specific AWS region. Client should try to delete some ENIs or get its account limit raised. For more information, go to `Amazon VPC Limits <http://docs.aws.amazon.com/AmazonVPC/latest/UserGuide/VPC_Appendix_Limits.html>`_ in the Amazon Virtual Private Cloud User Guide (see the Network interfaces per VPC entry in the table).",
            "members": [
                {
                    "name": "ErrorCode",
                    "shape": "ErrorCode"
                },
                {
                    "name": "Message",
                    "shape": "ErrorMessage"
                }
            ]
        },
        "NoFreeAddressesInSubnet": {
            "type": "structure",
            "documentation": "Returned if ``IpAddress`` was not specified in the request and there are no free IP addresses in the subnet.",
            "members": [
                {
                    "name": "ErrorCode",
                    "shape": "ErrorCode"
                },
                {
                    "name": "Message",
                    "shape": "ErrorMessage"
                }
            ]
        },
        "SecurityGroup": {
            "type": "string"
        },
        "SecurityGroupLimitExceeded": {
            "type": "structure",
            "documentation": "Returned if the size of ``SecurityGroups`` specified in the request is greater than five.",
            "members": [
                {
                    "name": "ErrorCode",
                    "shape": "ErrorCode"
                },
                {
                    "name": "Message",
                    "shape": "ErrorMessage"
                }
            ]
        },
        "SecurityGroupNotFound": {
            "type": "structure",
            "documentation": "Returned if one of the specified security groups does not exist in the subnet's VPC.",
            "members": [
                {
                    "name": "ErrorCode",
                    "shape": "ErrorCode"
                },
                {
                    "name": "Message",
                    "shape": "ErrorMessage"
                }
            ]
        },
        "SecurityGroups": {
            "type": "list",
            "of": "SecurityGroup"
        },
        "SubnetId": {
            "type": "string"
        },
        "SubnetNotFound": {
            "type": "structure",
            "documentation": "Returned if there is no subnet with ID ``SubnetId`` provided in the request.",
            "members": [
                {
                    "name": "ErrorCode",
                    "shape": "ErrorCode"
                },
                {
                    "name": "Message",
                    "shape": "ErrorMessage"
                }
            ]
        },
        "Tag": {
            "type": "structure",
            "documentation": "A tag is a pair of key and value. The allowed characters in keys and values are letters, whitespace, and numbers, representable in UTF-8, and the characters '+', '-', '=', '.', '_', ':', and '/'.",
            "members": [
                {
                    "name": "Key",
                    "shape": "TagKey",
                    "documentation": "<p>Tag key, a string. The key must not start with \"aws:\".</p>"
                },
                {
                    "name": "Value",
                    "shape": "TagValue",
                    "documentation": "<p>Value of the tag key.</p>"
                }
            ]
        },
        "TagKey": {
            "type": "string"
        },
        "TagKeys": {
            "type": "list",
            "of": "TagKey"
        },
        "TagValue": {
            "type": "string"
        },
        "Tags": {
            "type": "list",
            "of": "Tag"
        },
        "Timestamp": {
            "type": "timestamp"
        },
        "UnsupportedAvailabilityZone": {
            "type": "structure",
            "members": [
                {
                    "name": "ErrorCode",
                    "shape": "ErrorCode"
                },
                {
                    "name": "Message",
                    "shape": "ErrorMessage"
                }
            ]
        }
    }
}